Tekla.Structures.ModelInternal.dotTaskDependency_t
Struct for the TaskDependency.

Tekla.Structures.ModelInternal.dotTaskDependency_t.ModelObject
The object we are extending (Inherited from).

Tekla.Structures.ModelInternal.dotTaskDependency_t.PrimaryId
Task ID of the primary task dependency.

Tekla.Structures.ModelInternal.dotTaskDependency_t.SecondaryId
Task ID of the secondary task dependency.

Tekla.Structures.ModelInternal.dotTaskDependency_t.Type
The type of the task dependency.

Tekla.Structures.ModelInternal.dotTaskDependency_t.Lag
Lag of the task dependency.

Tekla.Structures.ModelInternal.dotTaskDependency_t.Local
Locality indicates if the dependency was created in Tekla Structures and Task Manager or imported.